In [8]:
input_list =  [1, 2, 3, 4]

for i in range(len(input_list)):
    input_list[i] = int(input_list[i])
t = tuple(input_list)
print(hash(t))

485696759010151909

In [2]:
n = int(input())
integer_list = map(int, input().split())

input_list = [int(x) for x in integer_list]
t = tuple(input_list)
print(hash(t))

2
4
3430022387567

In [7]:
print(type(input_list))

<class 'list'>

In [13]:
n = int(input())
integer_list = map(int, input().split())

4
5

In [19]:
print(hash(2))

2

# Replace multiple values

In [2]:
import pandas as pd, numpy as np

In [5]:
data=pd.DataFrame(np.array([['a', 2, 3], ['h', 5, 6], ['h', 8, 9]]),
                columns=['a', 'b', 'c'])
data

   a  b  c
0  a  2  3
1  h  5  6
2  h  8  9

### .replace() function

In [7]:
# Replace all non-Hispanic ethnicities with 'NON HISPANIC'
data['a'].replace(['a', 'h'],'non_l', inplace=True)
data

       a  b  c
0  non_l  2  3
1  non_l  5  6
2  non_l  8  9

### .loc()` indexer.

In [13]:
data=pd.DataFrame(np.array([['a', 2, 3], ['h', 5, 6], ['h', 8, 9]]),
                columns=['a', 'b', 'c'])
# Replace all non-Hispanic ethnicities with 'NON HISPANIC'
data['a'].loc[(data["a"] == 'a') | 
              (data["a"] == 'h') ] = 'NON'
data

     a  b  c
0  NON  2  3
1  NON  5  6
2  NON  8  9

# Replace multiple values II

In [10]:
data=pd.DataFrame(np.array([['aa', 2, 3], ['bb', 5, 6], ['cc', 8, 9],
                           ['ehh', 2, 3]]),
                columns=['a', 'b', 'c'])
data

     a  b  c
0   aa  2  3
1   bb  5  6
2   cc  8  9
3  ehh  2  3

In [11]:
# Replace all non-Hispanic ethnicities with 'NON HISPANIC'
data['a'].replace(['aa', 'bb' , 'cc'],['eha', 'ehb', 'ehc'], inplace=True)
data

     a  b  c
0  eha  2  3
1  ehb  5  6
2  ehc  8  9
3  ehh  2  3

In [12]:
# Replace all non-Hispanic ethnicities with 'NON HISPANIC'
data['a'].replace({'eha': 'aa','ehb': 'bb' ,'ehc':'cc'}, inplace=True)
data

     a  b  c
0   aa  2  3
1   bb  5  6
2   cc  8  9
3  ehh  2  3

In [14]:
data['b'].replace({2: 'sec',5: 'fiv' ,8:'egt'}, inplace=True)
data

     a  b  c
0   aa  2  3
1   bb  5  6
2   cc  8  9
3  ehh  2  3

# generator for a pandas DataFrame

In [15]:
# Create a generator over the rows
generator = data.iterrows()

# Access the elements of the 2nd row
first_element = next(generator)
second_element = next(generator)
print(first_element, second_element)

(0, a    aa
b     2
c     3
Name: 0, dtype: object) (1, a    bb
b     5
c     6
Name: 1, dtype: object)

# Looping using the .apply() function

.apply() is a very useful to iterate through the rows of a DataFrame and apply a specific function.

In [15]:
poker_hands= pd.read_csv("poker_hand.csv")
poker_hands.head(5)

   S1  R1  S2  R2  S3  R3  S4  R4  S5  R5  Class
0   1  10   1  11   1  13   1  12   1   1      9
1   2  11   2  13   2  10   2  12   2   1      9
2   3  12   3  11   3  13   3  10   3   1      9
3   4  10   4  11   4   1   4  13   4  12      9
4   4   1   4  13   4  12   4  11   4  10      9

In [22]:
# Define the lambda transformation
get_square = lambda x: x**2

# Apply the transformation
data_sum = poker_hands.apply(get_square)
print(data_sum.head())

   S1   R1  S2   R2  S3   R3  S4   R4  S5   R5  Class
0   1  100   1  121   1  169   1  144   1    1     81
1   4  121   4  169   4  100   4  144   4    1     81
2   9  144   9  121   9  169   9  100   9    1     81
3  16  100  16  121  16    1  16  169  16  144     81
4  16    1  16  169  16  144  16  121  16  100     81

In [23]:
get_variance = lambda x: np.var(x)

# Apply the transformation for every row -> axis=1.
data_tr = poker_hands[['R1', 'R2', 'R3', 'R4', 'R5']].apply(get_variance, axis=1)
print(data_tr.head())

0    18.64
1    18.64
2    18.64
3    18.64
4    18.64
dtype: float64

In [24]:
# Apply the transformation
data_tr = poker_hands[['R1', 'R2', 'R3', 'R4', 'R5']].apply(get_variance, axis=0)
print(data_tr.head())

R1    14.060473
R2    14.189523
R3    14.024270
R4    14.040552
R5    13.998851
dtype: float64

### Vectorization over pandas series

In [26]:
# Calculate the mean rank in each hand
# pandas vectorization for rows
mean_r = poker_hands[['R1', 'R2', 'R3', 'R4', 'R5']].mean(axis=1)
print(mean_r.head())

# Calculate the mean rank of each of the 5 card in all hands
# pandas vectorization for columns
mean_c = poker_hands[['R1', 'R2', 'R3', 'R4', 'R5']].mean(axis=0)
print(mean_c.head())

0    9.4
1    9.4
2    9.4
3    9.4
4    9.4
dtype: float64
R1    6.995242
R2    7.014194
R3    7.014154
R4    6.942463
R5    6.962735
dtype: float64

In [27]:
# Calculate the variance using vectorization with pandas
poker_var = poker_hands[['R1', 'R2', 'R3', 'R4', 'R5']].var(axis=1)
print(poker_var.head())

0    23.3
1    23.3
2    23.3
3    23.3
4    23.3
dtype: float64

In [28]:
#a.var(axis=None, dtype=None, out=None, ddof=0, keepdims=False)

#Returns the variance of the array elements, along given axis.

#Refer to `numpy.var` for full documentation

#poker_hands.values.var()
# Calculate the variance using vectorization with NumPy.
poker_var = poker_hands[['R1', 'R2', 'R3', 'R4', 'R5']].values.var(axis=1, ddof=1)
print(poker_var[0:5])

[23.3 23.3 23.3 23.3 23.3]

# Data transformation using .groupby().transform

In [1]:
import pandas as pd,numpy as np
restaurant_data=pd.read_csv("restaurant_data.csv")
restaurant_data.head(5)

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [6]:
# Define the min-max transformation
min_max_tr = lambda x: (x - x.min()) / (x.max() - x.min())

# Group the data according to the time
restaurant_grouped = restaurant_data.groupby('time')

# Apply the transformation
restaurant_min_max_group = restaurant_grouped.transform(min_max_tr)
print(restaurant_min_max_group.head())

   total_bill       tip  size
0    0.291579  0.001111   0.2
1    0.152283  0.073333   0.4
2    0.375786  0.277778   0.4
3    0.431713  0.256667   0.2
4    0.450775  0.290000   0.6

In [9]:
# Define the exponential transformation
exp_tr = lambda x: np.exp(-x.mean()*x) * x.mean()

# Group the data according to the time
restaurant_grouped = restaurant_data.groupby('time')

# Apply the transformation
restaurant_exp_group = restaurant_grouped['tip'].transform(exp_tr)
print(restaurant_exp_group.head())

0    0.135141
1    0.017986
2    0.000060
3    0.000108
4    0.000042
Name: tip, dtype: float64

In [12]:
zscore = lambda x: (x - x.mean()) / x.std()

# Apply the normalization transformation to the grouped object
restaurant_trans = restaurant_grouped.transform(zscore)
print(restaurant_trans.head())

   total_bill       tip      size
0   -0.416446 -1.457045 -0.692873
1   -1.143855 -1.004475  0.405737
2    0.023282  0.276645  0.405737
3    0.315339  0.144355 -0.692873
4    0.414880  0.353234  1.504347

In [21]:
poker_grouped = poker_hands.groupby('Class')

zscore = lambda x: (x - x.mean()) / x.std()

# Apply the transformation
poker_trans = poker_grouped.transform(zscore)

# Re-group the grouped object
# After you apply the normalization transformation, 
# you can group again on the same variable, and then check the mean 
# and the standard deviation of each group.
poker_regrouped = poker_trans.groupby(poker_hands['Class'])

# Print each group's means and standard deviation
print(np.round(poker_regrouped.mean(), 3))
print(poker_regrouped.std())

        S1   R1   S2   R2   S3   R3   S4   R4   S5   R5
Class
0      0.0  0.0 -0.0 -0.0 -0.0 -0.0  0.0 -0.0 -0.0 -0.0
1     -0.0 -0.0  0.0 -0.0  0.0  0.0  0.0  0.0 -0.0  0.0
2     -0.0 -0.0 -0.0 -0.0 -0.0  0.0 -0.0  0.0  0.0  0.0
3     -0.0  0.0  0.0 -0.0 -0.0 -0.0  0.0 -0.0  0.0 -0.0
4      0.0 -0.0 -0.0 -0.0  0.0 -0.0 -0.0  0.0  0.0  0.0
5     -0.0 -0.0 -0.0  0.0 -0.0  0.0 -0.0 -0.0 -0.0  0.0
6     -0.0 -0.0 -0.0  0.0  0.0 -0.0  0.0  0.0 -0.0  0.0
7      0.0 -0.0 -0.0  0.0 -0.0  0.0  0.0 -0.0 -0.0 -0.0
8     -0.0  0.0 -0.0  0.0 -0.0  0.0 -0.0  0.0 -0.0 -0.0
9      0.0 -0.0  0.0 -0.0  0.0 -0.0  0.0  0.0  0.0 -0.0
        S1   R1   S2   R2   S3   R3   S4   R4   S5   R5
Class
0      1.0  1.0  1.0  1.0  1.0  1.0  1.0  1.0  1.0  1.0
1      1.0  1.0  1.0  1.0  1.0  1.0  1.0  1.0  1.0  1.0
2      1.0  1.0  1.0  1.0  1.0  1.0  1.0  1.0  1.0  1.0
3      1.0  1.0  1.0  1.0  1.0  1.0  1.0  1.0  1.0  1.0
4      1.0  1.0  1.0  1.0  1.0  1.0  1.0  1.0  1.0  1.0
5      1.0  1.0  1.0  1.0  1.0  1.0  1.0  1.0  1.0  1.0
6      1.0  1.0  1.0  1.0  1.0  1.0  1.0  1.0  1.0  1.0
7      1.0  1.0  1.0  1.0  1.0  1.0  1.0  1.0  1.0  1.0
8      1.0  1.0  1.0  1.0  1.0  1.0  1.0  1.0  1.0  1.0
9      1.0  1.0  1.0  1.0  1.0  1.0  1.0  1.0  1.0  1.0

# Missing value imputation using transform()

In [33]:
# Group both objects according to smoke condition
restaurant_nan_grouped = restaurant_data.groupby('smoker')

# Store the number of present values
restaurant_nan_nval = restaurant_nan_grouped['tip'].count()

# Print the group-wise missing entries
print(restaurant_nan_grouped['total_bill'].count() - restaurant_nan_nval)

smoker
No     0
Yes    0
dtype: int64

In [35]:
restaurant_nan_nval

smoker
No     151
Yes     93
Name: tip, dtype: int64

In [36]:
restaurant_nan_grouped['total_bill'].count()

smoker
No     151
Yes     93
Name: total_bill, dtype: int64

In [37]:
restaurant_data['tip'].count()

244

In [38]:
restaurant_data.np.nan()

AttributeError: 'DataFrame' object has no attribute 'np'

In [6]:
# Define the lambda function
missing_trans = lambda x: x.fillna(x.median())

# Group the data according to time
restaurant_grouped = restaurant_data.groupby('time')

# Apply the transformation
restaurant_impute = restaurant_grouped.transform(missing_trans)
print(restaurant_impute.head())

   total_bill   tip  size
0       16.99  1.01     2
1       10.34  1.66     3
2       21.01  3.50     3
3       23.68  3.31     2
4       24.59  3.61     4

# Data filtration using the filter() function

In [10]:
restaurant_data=pd.read_csv("restaurant_data.csv")
restaurant_data.head(5)

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [3]:
t=[restaurant_data.loc[:,['day']]==i['tip'] for i in restaurant_data.loc[:,['day']].drop_duplicates()
  if restaurant_data.loc[:,['day']]==i['total_bill'].mean()>20]

resturant_filtered = t[0]
for j in t[1:]:
    resturant_filtered = resturant_filtered.append(j,ignore_index=True)

TypeError: string indices must be integers

In [9]:
restaurant_data.loc[:,['day']].drop_duplicates()

     day
0    Sun
19   Sat
77  Thur
90   Fri

### From the total_bill_40 DataFrame, select only the entries that have a mean total_bill greater than $20, grouped by day.

In [38]:
# Filter the days where the count of total_bill is greater than $40
total_bill_40 = restaurant_data.groupby('day').filter(lambda x: x['total_bill'].count() > 40)

# Select only the entries that have a mean total_bill greater than $20
total_bill_20 = total_bill_40.groupby('day').filter(lambda x : x['total_bill'].mean() > 20)

# Print days of the week that have a mean total_bill greater than $20
print('Days of the week that have a mean total_bill greater than $20:', total_bill_20.day.unique())

Days of the week that have a mean total_bill greater than $20: ['Sun' 'Sat']

In [7]:
# Select only the entries that have a mean total_bill greater than $20
total_bill_20 = restaurant_data.groupby('day').filter(lambda x : x['total_bill'].mean() > 20)
# Print days of the week that have a mean total_bill greater than $20
print('Days of the week that have a mean total_bill greater than $20:', total_bill_20.day.unique())

Days of the week that have a mean total_bill greater than $20: ['Sun' 'Sat']